# ContinuousrailJoinTypeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousrailJoinTypeParam Property
ParameterTypeId Class See Also
---
"Rail Path Join"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailJoinTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailJoinTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailJoinTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace